BinBrain/app/controllers/home_controller.rb

  def show
    @empresa = Empresa.find(params[:id])
---
SELECT "empresas".* FROM "empresas" WHERE "empresas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]