BinBrain/app/views/home/index.html.erb

SELECT "producto_escaneados".* FROM "producto_escaneados" WHERE "producto_escaneados"."empresa_id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)  [["empresa_id", 1], ["empresa_id", 2], ["empresa_id", 3], ["empresa_id", 4], ["empresa_id", 5], ["empresa_id", 6], ["empresa_id", 7], ["empresa_id", 8], ["empresa_id", 9], ["empresa_id", 10]]
SELECT SUM("producto_escaneados"."cantidad") FROM "producto_escaneados" WHERE "producto_escaneados"."empresa_id" = ?  [["empresa_id", 1]]
---
        <td><%= empresa.name %></td>
        <td><%= empresa.producto_escaneados.sum(:cantidad) %></td>