BinBrain/app/views/home/show.html.erb

<h1><%= @empresa.name %></h1>
<p>Cantidad de productos escaneados: <%= @empresa.producto_escaneados.sum(:cantidad) %></p>
---
SELECT "producto_escaneados".* FROM "producto_escaneados" WHERE "producto_escaneados"."empresa_id" = ?  [["empresa_id", 1]]
SELECT SUM("producto_escaneados"."cantidad") FROM "producto_escaneados" WHERE "producto_escaneados"."empresa_id" = ?  [["empresa_id", 1]]

  <tbody>
    <% @empresa.producto_escaneados.each do |producto| %>
---
SELECT "producto_escaneados".* FROM "producto_escaneados" WHERE "producto_escaneados"."empresa_id" = ?  [["empresa_id", 1]]